# import array
import struct
FunCodeDict = {0x03: '读取', 0x06: '设置', 0x10: '设置'}
RegisterBlockDict = {0x00: '状态监控区', 0x01: '状态监控区', 0x10: '分解动作区', 0x11: '分解动作区', 0x20: '连贯动作区', 0x30: '系统参数区'}
StateBlock_01_Dict = {0x00: '脖子前后向电机状态', 0x01: '脖子前后向电机角度',
                      0x02: '脖子左右向电机状态', 0x03: '脖子左右向电机角度',
                      0x04: '左肩膀前后向电机状态', 0x05: '左肩膀前后向电机角度',
                      0x06: '右肩膀前后向电机状态', 0x07: '右肩膀前后向电机角度',
                      0x08: '左肩膀左右向电机状态', 0x09: '左肩膀左右向电机角度',
                      0x0A: '右肩膀左右向电机状态', 0x0B: '右肩膀左右向电机角度',
                      0x0C: '左臂转向电机状态', 0x0D: '左臂转向电机角度',
                      0x0E: '右臂转向电机状态', 0x0F: '右臂转向电机角度',
                      0x10: '左肘前后向电机状态', 0x11: '左肘前后向电机角度',
                      0x12: '右肘前后向电机状态', 0x13: '右肘前后向电机角度',
                      0x14: '左前臂转向电机状态', 0x15: '左前臂转向电机角度',
                      0x16: '右前臂转向电机状态', 0x17: '右前臂转向电机角度',
                      0x18: '左腕前后向电机状态', 0x19: '左腕前后向电机角度',
                      0x1A: '右腕前后向电机状态', 0x1B: '右腕前后向电机角度',
                      0x1C: '左腕左右向电机状态', 0x1D: '左腕左右向电机角度',
                      0x1E: '右腕左右向电机状态', 0x1F: '右腕左右向电机角度',
                      0x20: '左大腿根左右向电机状态', 0x21: '左大腿根左右向电机角度',
                      0x22: '右大腿根左右向电机状态', 0x23: '右大腿根左右向电机角度',
                      0x24: '左大腿根前后向电机状态', 0x25: '左大腿根前后向电机角度',
                      0x26: '右大腿根前后向电机状态', 0x27: '右大腿根前后向电机角度',
                      0x28: '左膝盖前后向电机状态', 0x29: '左膝盖前后向电机角度',
                      0x2A: '右膝盖前后向电机状态', 0x2B: '右膝盖前后向电机角度',
                      0x2C: '左脚腕前后向电机状态', 0x2D: '左脚腕前后向电机角度',
                      0x2E: '右脚腕前后向电机状态', 0x2F: '右脚腕前后向电机角度',
                      0x30: '左脚腕左右向电机状态', 0x31: '左脚腕左右向电机角度',
                      0x32: '右脚腕左右向电机状态', 0x33: '右脚腕左右向电机角度',
                      0x34: '左大腿转向电机状态', 0x35: '左大腿转向电机角度',
                      0x36: '右大腿转向电机状态', 0x37: '右大腿转向电机角度',
                      0x38: '左睛状态', 0x39: '左睛角度/RGB',
                      0x3A: '右睛状态', 0x3B: '右睛角度/RGB',
                      0x3C: '腰部电机状态', 0x3D: '腰部电机角度',
                      0x3E: '下巴电机状态', 0x3F: '下巴电机角度'}

StateBlock_02_Dict = {0x00: '软件版本号', 0x01: '硬件版本号',
                      0x02: '硬件序列号低位', 0x03: '硬件序列号高位',
                      0x04: '红外探头状态', 0x05: '超声波状态',
                      0x06: '下位机状态', 0x07: '左手感应',
                      0x08: '右手感应', 0x09: '头部触摸',
                      0x0A: '惯性单元X轴角度', 0x0B: '惯性单元Y轴角度',
                      0x0C: '惯性单元Z轴角度', 0x0D: '惯性单元X轴加速度',
                      0x0E: '惯性单元Y轴加速度', 0x0F: '惯性单元Z轴加速度',
                      0x10: 'X轴角速度', 0x11: 'Y轴角速度',
                      0x12: 'Z轴角速度', 0x13: 'X轴磁场',
                      0x14: 'Y轴磁场', 0x15: 'Z轴磁场',
                      0x16: '姿态识别', 0x17: '系列动作运行状态',
                      0x18: '最大存储容量', 0x19: '剩余文件数量',
                      0x1A: '当前可用文件号', 0x1B: '当前可用记录号',
                      0x1C: '已保存表情数量', 0x1D: '已保存系列动作数量',
                      0x1E: '运行模式', 0x1F: '随机数低位',
                      0x20: '随机数高位', 0x21: '二维码01',
                      0x22: '二维码02', 0x23: '二维码03',
                      0x24: '二维码04', 0x25: '二维码05',
                      0x26: '二维码06'}


def calculate(modbus_request):
    # request is a bytearray like bytearray(b'\x01\x06\x10\x00\x00\x08\x8c\xcc')
    # print(modbus_request)
    # s = array.array('B', modbus_request[1])
    s = modbus_request[1]
    (slaveid, funcode) = struct.unpack('>BB', s[0:2])  # 拆包
    regaddress = struct.unpack('>BB', s[2:4])  # 拆包
    if s[2] == 0x00:  # StateBlock_01_Dict
        print("收到", FunCodeDict[s[1]], RegisterBlockDict[s[2]], StateBlock_01_Dict[s[3]], "起始地址:", regaddress, "读取长度"+str(s[5]))
    elif s[2] == 0x01:  # StateBlock_02_Dict
        print("收到", FunCodeDict[s[1]], RegisterBlockDict[s[2]], StateBlock_02_Dict[s[3]], "起始地址:", regaddress, "读取长度"+str(s[5]))
    else:
        print("收到", FunCodeDict[s[1]], RegisterBlockDict[s[2]], "设置长度"+str(s[5]))
